Revit 2027 API
ReferenceIntersector.TargetType Property
 The type of reference to find.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FindReferenceTarget TargetType { get; set; }
Public Property TargetType As FindReferenceTarget
	Get
	Set
public:
property FindReferenceTarget TargetType {
	FindReferenceTarget get ();
	void set (FindReferenceTarget value);
}
member TargetType : FindReferenceTarget with get, set
Property Value
FindReferenceTarget
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace